#ifndef DEBUGWND_H

/********************************************************************************
 * 内容  : デバッグウィンドウクラスの登録、ウィンドウの生成
 * 引数  : int nCmdShow
 * 戻り値: HWND
 ***************************************/
HWND DebugWndCreate( int nCmdShow );

/********************************************************************************
 * 内容  : デバッグウィンドウ内で処理するメッセージを判定する
 * 引数  : MSG *msgPtr
 * 戻り値: BOOL
 ***************************************/
BOOL IsDebugWndMessage( MSG *msgPtr );

#define DEBUGWND_H
#endif /* DEBUGWND_H */
