#ifndef IOWND_H

/********************************************************************************
 * 内容  : IOウィンドウクラスの登録、ウィンドウの生成
 * 引数  : int nCmdShow
 * 戻り値: HWND
 ***************************************/
HWND IoWndCreate( HWND hWnd );

/********************************************************************************
 * 内容  : IOウィンドウのサイズ変更
 * 引数  : int cxClient
 * 引数  : int cyClient
 * 戻り値: BOOL
 ***************************************/
BOOL IoWndSize( int cxClient, int cyClient );

/********************************************************************************
 * 内容  : IOウィンドウの破壊
 * 引数  : int nCmdShow
 * 戻り値: BOOL
 ***************************************/
void IoWndDestroy( void );

/********************************************************************************
 * 内容  : 文字列出力
 * 引数  : TCHAR* strPtr
 * 引数  : int length
 * 戻り値: なし
 ***************************************/
void IoWndPrint( TCHAR* strPtr, int length );

#define IOWND_H
#endif /* IOWND_H */
