#ifndef IOWND_BUFFER_H

typedef struct tag_iownd_buffer_data
{
    struct tag_iownd_buffer_data *prevPtr;
    struct tag_iownd_buffer_data *nextPtr;
    DWORD                         dataSize;
    TCHAR                         data[];
} S_IOWND_BUFF_DATA;

/********************************************************************************
 * 内容  : IOウィンドウバッファの初期化
 * 引数  : なし
 * 戻り値: なし
 ***************************************/
void IoWndBuffInit( void );

/********************************************************************************
 * 内容  : IOウィンドウバッファ(連結リスト)へのデータ追加
 * 引数  : TCHAR* strPtr
 * 引数  : DWORD  length
 * 戻り値: なし
 ***************************************/
void IoWndBuffSetLinkedList( TCHAR* strPtr, DWORD length );

/********************************************************************************
 * 内容  : IOウィンドウバッファへのデータ追加
 * 引数  : TCHAR* strPtr
 * 引数  : DWORD  length
 * 戻り値: なし
 ***************************************/
void IoWndBuffSet( TCHAR* strPtr, DWORD length );

/********************************************************************************
 * 内容  : IOウィンドウバッファのデータポインタ取得
 * 引数  : なし
 * 戻り値: TCHAR *
 ***************************************/
TCHAR * IoWndGetBuffPtr( void );

/********************************************************************************
 * 内容  : IOウィンドウバッファのデータサイズ取得
 * 引数  : なし
 * 戻り値: DWORD
 ***************************************/
DWORD IoWndGetBuffSize( void );

/********************************************************************************
 * 内容  : IOウィンドウバッファの最大行サイズ取得
 * 引数  : なし
 * 戻り値: DWORD
 ***************************************/
DWORD IoWndGetLineMaxSize( void );

/********************************************************************************
 * 内容  : IOウィンドウバッファの最大文字サイズ取得
 * 引数  : なし
 * 戻り値: DWORD
 ***************************************/
DWORD IoWndGetColumnMaxSize( void );

/********************************************************************************
 * 内容  : 指定行のデータアドレス取得
 * 引数  : DWORD lineNum
 * 戻り値: S_IOWND_BUFF_DATA *
 ***************************************/
S_IOWND_BUFF_DATA *IoWndBuffGetLinePtr( DWORD lineNum );

#define IOWND_BUFFER_H
#endif /* IOWND_BUFFER_H */
